zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/sc_reg.h
/**************************************************************************//**
 * @file     sc_reg.h
 * @version  V1.00
 * @brief    SC register definition header file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#ifndef __SC_REG_H__
#define __SC_REG_H__

#if defined ( __CC_ARM   )
    #pragma anon_unions
#endif

/**
  @addtogroup REGISTER Control Register
  @{
*/

/**
  @addtogroup SC Smart Card Host Interface (SC)
  Memory Mapped Structure for SC Controller
  @{
*/

typedef struct
{
    /**
       * @var SC_T::DAT
       * Offset: 0x00  SC Receive/Transmit Holding Buffer Register
       * ---------------------------------------------------------------------------------------------------
       * |Bits    |Field     |Descriptions
       * | :----: | :----:   | :---- |
       * |[7:0]   |DAT       |Receive/Transmit Holding Buffer
       * |        |          |Write Operation:
       * |        |          |By writing data to DAT, the SC will send out an 8-bit data.
       * |        |          |Note: If SCEN (SCn_CTL[0]) is not enabled, DAT cannot be programmed.
       * |        |          |Read Operation:
       * |        |          |By reading DAT, the SC will return an 8-bit received data.
       * @var SC_T::CTL
       * Offset: 0x04  SC Control Register
       * ---------------------------------------------------------------------------------------------------
       * |Bits    |Field     |Descriptions
       * | :----: | :----:   | :---- |
       * |[0]     |SCEN      |SC Controller Enable Bit
       * |        |          |Set this bit to 1 to enable SC operation. If this bit is cleared,
       * |        |          |0 = SC will force all transition to IDLE state.
       * |        |          |1 = SC controller is enabled and all function can work correctly.
       * |        |          |Note1: SCEN must be set to 1 before filling in other SC registers, or smart card will not work properly.
       * |[1]     |RXOFF     |RX Transition Disable Control Bit
       * |        |          |This bit is used for disable Rx transition function.
       * |        |          |0 = The receiver Enabled.
       * |        |          |1 = The receiver Disabled.
       * |        |          |Note1: If AUTOCEN (SCn_CTL[3]) is enabled, this field is ignored.
       * |[2]     |TXOFF     |TX Transition Disable Control Bit
       * |        |          |This bit is used for disable Tx transition function.
       * |        |          |0 = The transceiver Enabled.
       * |        |          |1 = The transceiver Disabled.
       * |[3]     |AUTOCEN   |Auto Convention Enable Bit
       * |        |          |This bit is used for enable auto convention function.
       * |        |          |0 = Auto-convention Disabled.
       * |        |          |1 = Auto-convention Enabled.
       * |        |          |If user enables auto convention function, the setting step must be done before Answer to Reset (ATR)
       * |        |          |state and the first data must be 0x3B or 0x3F.
       * |        |          |After hardware received first data and stored it at buffer, hardware will decided the convention and
       * |        |          |change the CONSEL (SCn_CTL[5:4]) bits automatically when received first data is 0x3B or 0x3F.
       * |        |          |If received first byte is 0x3B, TS is direct convention, CONSEL (SCn_CTL[5:4]) will be set to 00
       * |        |          |automatically, otherwise the TS is inverse convention, and CONSEL (SCn_CTL[5:4]) will be set to 11.
       * |        |          |If the first data is not 0x3B or 0x3F, hardware will set ACERRIF (SCn_INTSTS[10]) and generate an
       * |        |          |interrupt to CPU when ACERRIEN (SCn_INTEN[10]) is enabled.
       * |[5:4]   |CONSEL    |Convention Selection
       * |        |          |00 = Direct convention.
       * |        |          |01 = Reserved.
       * |        |          |10 = Reserved.
       * |        |          |11 = Inverse convention.
       * |        |          |Note: If AUTOCEN (SCn_CTL[3]) is enabled, this field is ignored.
       * |[7:6]   |RXTRGLV   |Rx Buffer Trigger Level
       * |        |          |When the number of bytes in the receiving buffer equals the RXTRGLV, the RDAIF will be set
       * |        |          |If RDAIEN (SCn_INTEN[0]) is enabled, an interrupt will be generated to CPU.
       * |        |          |00 = Rx Buffer Trigger Level with 01 bytes.
       * |        |          |01 = Rx Buffer Trigger Level with 02 bytes.
       * |        |          |10 = Rx Buffer Trigger Level with 03 bytes.
       * |        |          |11 = Reserved.
       * |[12:8]  |BGT       |Block Guard Time (BGT)
       * |        |          |Block guard time means the minimum interval between the leading edges of two consecutive characters
       * |        |          |between different transfer directions
       * |        |          |This field indicates the counter for the bit length of block guard time
       * |        |          |According to ISO 7816-3, in T = 0 mode, user must fill 15 (real block guard time = 16.5) to this
       * |        |          |field; in T = 1 mode, user must fill 21 (real block guard time = 22.5) to it.
       * |        |          |Note: The real block guard time is BGT + 1.
       * |[14:13] |TMRSEL    |Timer Channel Selection
       * |        |          |00 = All internal timer function Disabled.
       * |        |          |11 = Internal 24 bit timer and two 8 bit timers Enabled.
       * |        |          |User can configure them by setting SCn_TMRCTL0[23:0], SCn_TMRCTL1[7:0] and SCn_TMRCTL2[7:0].
       * |        |          |Other configurations are reserved.
       * |[15]    |NSB       |Stop Bit Length
       * |        |          |This field indicates the length of stop bit.
       * |        |          |0 = The stop bit length is 2 ETU.
       * |        |          |1= The stop bit length is 1 ETU.
       * |        |          |Note1: The default stop bit length is 2. SC and UART adopts NSB to program the stop bit length.
       * |        |          |Note2: In UART mode, RX can receive the data sequence in 1 stop bit or 2 stop bits with NSB is set to 0.
       * |[18:16] |RXRTY     |RX Error Retry Count Number
       * |        |          |This field indicates the maximum number of receiver retries that are allowed when parity error has occurred.
       * |        |          |Note1: The real retry number is RXRTY + 1, so 8 is the maximum retry number.
       * |        |          |Note2: This field cannot be changed when RXRTYEN enabled
       * |        |          |The change flow is to disable RXRTYEN first and then fill in new retry value.
       * |[19]    |RXRTYEN   |RX Error Retry Enable Bit
       * |        |          |This bit enables receiver retry function when parity error has occurred.
       * |        |          |0 = RX error retry function Disabled.
       * |        |          |1 = RX error retry function Enabled.
       * |        |          |Note: User must fill in the RXRTY value before enabling this bit.
       * |[22:20] |TXRTY     |TX Error Retry Count Number
       * |        |          |This field indicates the maximum number of transmitter retries that are allowed when parity
       * |        |          |error has occurred.
       * |        |          |Note1: The real retry number is TXRTY + 1, so 8 is the maximum retry number.
       * |        |          |Note2: This field cannot be changed when TXRTYEN enabled
       * |        |          |The change flow is to disable TXRTYEN first and then fill in new retry value.
       * |[23]    |TXRTYEN   |TX Error Retry Enable Bit
       * |        |          |This bit enables transmitter retry function when parity error has occurred.
       * |        |          |0 = TX error retry function Disabled.
       * |        |          |1 = TX error retry function Enabled.
       * |[25:24] |CDDBSEL   |Card Detect De-bounce Selection
       * |        |          |This field indicates the card detect de-bounce selection.
       * |        |          |00 = De-bounce sample card insert once per 384 (128 * 3) SC module clocks and de-bounce
       * |        |          |sample card removal once per 128 SC module clocks.
       * |        |          |Other configurations are reserved.
       * |[26]    |CDLV      |Card Detect Level Selection
       * |        |          |0 = When hardware detects the card detect pin (SCn_CD) from high to low, it indicates a card is detected.
       * |        |          |1 = When hardware detects the card detect pin (SCn_CD) from low to high, it indicates a card is detected.
       * |        |          |Note: User must select card detect level before Smart Card controller enabled.
       * |[30]    |SYNC      |SYNC Flag Indicator (Read Only)
       * |        |          |Due to synchronization, user should check this bit before writing a new value to RXRTY and TXRTY fields.
       * |        |          |0 = Synchronizing is completion, user can write new data to RXRTY and TXRTY.
       * |        |          |1 = Last value is synchronizing.
       * @var SC_T::ALTCTL
       * Offset: 0x08  SC Alternate Control Register
       * ---------------------------------------------------------------------------------------------------
       * |Bits    |Field     |Descriptions
       * | :----: | :----:   | :---- |
       * |[0]     |TXRST     |TX Software Reset
       * |        |          |When TXRST is set, all the bytes in the transmit buffer and TX internal state machine will be cleared.
       * |        |          |0 = No effect.
       * |        |          |1 = Reset the TX internal state machine and pointers.
       * |        |          |Note: This bit will be auto cleared after reset is complete.
       * |[1]     |RXRST     |Rx Software Reset
       * |        |          |When RXRST is set, all the bytes in the receive buffer and Rx internal state machine will be cleared.
       * |        |          |0 = No effect.
       * |        |          |1 = Reset the Rx internal state machine and pointers.
       * |        |          |Note: This bit will be auto cleared after reset is complete.
       * |[2]     |DACTEN    |Deactivation Sequence Generator Enable Bit
       * |        |          |This bit enables SC controller to initiate the card by deactivation sequence.
       * |        |          |0 = No effect.
       * |        |          |1 = Deactivation sequence generator Enabled.
       * |        |          |Note1: When the deactivation sequence completed, this bit will be cleared automatically and
       * |        |          |the INITIF (SCn_INTSTS[8]) will be set to 1.
       * |        |          |Note2: This field will be cleared by TXRST (SCn_ALTCTL[0]) and RXRST (SCn_ALTCTL[1])
       * |        |          |Thus, do not fill in this bit DACTEN, TXRST and RXRST at the same time.
       * |        |          |Note3: If SCEN (SCn_CTL[0]) is not enabled, this filed cannot be programmed.
       * |[3]     |ACTEN     |Activation Sequence Generator Enable Bit
       * |        |          |This bit enables SC controller to initiate the card by activation sequence.
       * |        |          |0 = No effect.
       * |        |          |1 = Activation sequence generator Enabled.
       * |        |          |Note1: When the activation sequence completed, this bit will be cleared automatically and the
       * |        |          |INITIF (SCn_INTSTS[8]) will be set to 1.
       * |        |          |Note2: This field will be cleared by TXRST (SCn_ALTCTL[0]) and RXRST (SCn_ALTCTL[1])
       * |        |          |Thus, do not fill in this bit ACTEN, TXRST and RXRST at the same time.
       * |        |          |Note3: If SCEN (SCn_CTL[0]) is not enabled, this filed cannot be programmed.
       * |        |          |Note4: During the activation sequence, RX is disabled automatically and can not receive data
       * |        |          |After the activation sequence completion, RXOFF (SCn_CTL[1]) keeps the state before hardware activation.
       * |[4]     |WARSTEN   |Warm Reset Sequence Generator Enable Bit
       * |        |          |This bit enables SC controller to initiate the card by warm reset sequence.
       * |        |          |0 = No effect.
       * |        |          |1 = Warm reset sequence generator Enabled.
       * |        |          |Note1: When the warm reset sequence completed, this bit will be cleared automatically and the
       * |        |          |INITIF (SCn_INTSTS[8]) will be set to 1.
       * |        |          |Note2: This field will be cleared by TXRST (SCn_ALTCTL[0]) and RXRST (SCn_ALTCTL[1])
       * |        |          |Thus, do not fill in this bit WARSTEN, TXRST and RXRST at the same time.
       * |        |          |Note3: If SCEN (SCn_CTL[0]) is not enabled, this filed cannot be programmed.
       * |        |          |Note4: During the warm reset sequence, RX is disabled automatically and can not receive data
       * |        |          |After the warm reset sequence completion, RXOFF (SCn_CTL[1]) keeps the state before perform
       * |        |          |warm reset sequence.
       * |[5]     |CNTEN0    |Internal Timer0 Start Enable Bit
       * |        |          |This bit enables Timer 0 to start counting
       * |        |          |User can fill 0 to stop it and set 1 to reload and count
       * |        |          |The counter unit is ETU base.
       * |        |          |0 = Stops counting.
       * |        |          |1 = Start counting.
       * |        |          |Note1: This field is used for internal 24 bit timer when TMRSEL (SCn_CTL[14:13]) is 11 only.
       * |        |          |Note2: If the operation mode is not in auto-reload mode (SCn_TMRCTL0[26] = 0), this bit will
       * |        |          |be auto-cleared by hardware.
       * |        |          |Note3: If SCEN (SCn_CTL[0]) is not enabled, this filed cannot be programmed.
       * |[6]     |CNTEN1    |Internal Timer1 Start Enable Bit
       * |        |          |This bit enables Timer 1 to start counting
       * |        |          |User can fill 0 to stop it and set 1 to reload and count
       * |        |          |The counter unit is ETU base.
       * |        |          |0 = Stops counting.
       * |        |          |1 = Start counting.
       * |        |          |Note1: This field is used for internal 8 bit timer when TMRSEL(SCn_CTL[14:13]) is 11 only
       * |        |          |Do not fill CNTEN1 when TMRSEL (SCn_CTL[14:13]) is not equal to 11.
       * |        |          |Note2: If the operation mode is not in auto-reload mode (SCn_TMRCTL1[26] = 0), this bit will
       * |        |          |be auto-cleared by hardware.
       * |        |          |Note3: If SCEN (SCn_CTL[0]) is not enabled, this filed cannot be programmed.
       * |[7]     |CNTEN2    |Internal Timer2 Start Enable Bit
       * |        |          |This bit enables Timer 2 to start counting
       * |        |          |User can fill 0 to stop it and set 1 to reload and count
       * |        |          |The counter unit is ETU base.
       * |        |          |0 = Stops counting.
       * |        |          |1 = Start counting.
       * |        |          |Note1: This field is used for internal 8 bit timer when TMRSEL (SCn_CTL[14:13]) is 11 only
       * |        |          |Do not fill in CNTEN2 when TMRSEL (SCn_CTL[14:13]) is not equal to 11.
       * |        |          |Note2: If the operation mode is not in auto-reload mode (SCn_TMRCTL2[26] = 0), this bit will
       * |        |          |be auto-cleared by hardware.
       * |        |          |Note3: If SCEN (SCn_CTL[0]) is not enabled, this filed cannot be programmed.
       * |[9:8]   |INITSEL   |Initial Timing Selection
       * |        |          |This fields indicates the initial timing of hardware activation, warm-reset or deactivation.
       * |        |          |The unit of initial timing is SC module clock.
       * |        |          |Activation: refer to SC Activation Sequence in Figure 7.17-54.
       * |        |          |Warm-reset: refer to Warm-Reset Sequence in Figure 7.17-5.
       * |        |          |Deactivation: refer to Deactivation Sequence in Figure 7.17-56.
       * |        |          |Note: When set activation and warm reset in Timer0 operation mode 0011, it may have deviation
       * |        |          |at most 128 SC module clock cycles.
       * |[11]    |ADACEN    |Auto Deactivation When Card Removal
       * |        |          |This bit is used for enable hardware auto deactivation when smart card is removed.
       * |        |          |0 = Auto deactivation Disabled.
       * |        |          |1 = Auto deactivation Enabled.
       * |        |          |Note: When the card is removed, hardware will stop any process and then do deactivation sequence
       * |        |          |if this bit is set
       * |        |          |If auto deactivation process completes, hardware will set INITIF (SCn_INTSTS[8]) also.
       * |[12]    |RXBGTEN   |Receiver Block Guard Time Function Enable Bit
       * |        |          |This bit enables the receiver block guard time function.
       * |        |          |0 = Receiver block guard time function Disabled.
       * |        |          |1 = Receiver block guard time function Enabled.
       * |[13]    |ACTSTS0   |Internal Timer0 Active Status (Read Only)
       * |        |          |This bit indicates the timer counter status of timer0.
       * |        |          |0 = Timer0 is not active.
       * |        |          |1 = Timer0 is active.
       * |        |          |Note: Timer0 is active does not always mean timer0 is counting the CNT (SCn_TMRCTL0[23:0]).
       * |[14]    |ACTSTS1   |Internal Timer1 Active Status (Read Only)
       * |        |          |This bit indicates the timer counter status of timer1.
       * |        |          |0 = Timer1 is not active.
       * |        |          |1 = Timer1 is active.
       * |        |          |Note: Timer1 is active does not always mean timer1 is counting the CNT (SCn_TMRCTL1[7:0]).
       * |[15]    |ACTSTS2   |Internal Timer2 Active Status (Read Only)
       * |        |          |This bit indicates the timer counter status of timer2.
       * |        |          |0 = Timer2 is not active.
       * |        |          |1 = Timer2 is active.
       * |        |          |Note: Timer2 is active does not always mean timer2 is counting the CNT (SCn_TMRCTL2[7:0]).
       * |[31]    |SYNC      |SYNC Flag Indicator (Read Only)
       * |        |          |Due to synchronization, user should check this bit when writing a new value to SCn_ALTCTL register.
       * |        |          |0 = Synchronizing is completion, user can write new data to SCn_ALTCTL register.
       * |        |          |1 = Last value is synchronizing.
       * @var SC_T::EGT
       * Offset: 0x0C  SC Extra Guard Time Register
       * ---------------------------------------------------------------------------------------------------
       * |Bits    |Field     |Descriptions
       * | :----: | :----:   | :---- |
       * |[7:0]   |EGT       |Extra Guard Time
       * |        |          |This field indicates the extra guard time value.
       * |        |          |Note: The extra guard time unit is ETU base.
       * @var SC_T::RXTOUT
       * Offset: 0x10  SC Receive Buffer Time-out Counter Register
       * ---------------------------------------------------------------------------------------------------
       * |Bits    |Field     |Descriptions
       * | :----: | :----:   | :---- |
       * |[8:0]   |RFTM      |SC Receiver FIFO Time-out Counter
       * |        |          |The time-out down counter resets and starts counting whenever the RX buffer received a new data
       * |        |          |Once the counter decrease to 1 and no new data is received or CPU does not read data by
       * |        |          |reading SCn_DAT, a receiver time-out flag RBTOIF (SCn_INTSTS[9]) will be set, and hardware will
       * |        |          |generate an interrupt to CPU when RBTOIEN (SCn_INTEN[9]) is enabled.
       * |        |          |Note1: The counter unit is ETU based and the interval of time-out is RFTM + 0.5.
       * |        |          |Note2: Filling in all 0 to this field indicates to disable this function.
       * @var SC_T::ETUCTL
       * Offset: 0x14  SC Element Time Unit Control Register
       * ---------------------------------------------------------------------------------------------------
       * |Bits    |Field     |Descriptions
       * | :----: | :----:   | :---- |
       * |[11:0]  |ETURDIV   |ETU Rate Divider
       * |        |          |The field is used for ETU clock rate divider.
       * |        |          |The real ETU is ETURDIV + 1.
       * |        |          |Note: User can configure this field, but this field must be greater than 0x04.
       * @var SC_T::INTEN
       * Offset: 0x18  SC Interrupt Enable Control Register
       * ---------------------------------------------------------------------------------------------------
       * |Bits    |Field     |Descriptions
       * | :----: | :----:   | :---- |
       * |[0]     |RDAIEN    |Receive Data Reach Interrupt Enable Bit
       * |        |          |This field is used to enable received data reaching trigger level RXTRGLV (SCn_CTL[7:6]) interrupt.
       * |        |          |0 = Receive data reach trigger level interrupt Disabled.
       * |        |          |1 = Receive data reach trigger level interrupt Enabled.
       * |[1]     |TBEIEN    |Transmit Buffer Empty Interrupt Enable Bit
       * |        |          |This field is used to enable transmit buffer empty interrupt.
       * |        |          |0 = Transmit buffer empty interrupt Disabled.
       * |        |          |1 = Transmit buffer empty interrupt Enabled.
       * |[2]     |TERRIEN   |Transfer Error Interrupt Enable Bit
       * |        |          |This field is used to enable transfer error interrupt
       * |        |          |The transfer error states is at SCn_STATUS register which includes receiver break error
       * |        |          |BEF (SCn_STATUS[6]), frame error FEF (SCn_STATUS[5]), parity error PEF (SCn_STATUS[4]), receive
       * |        |          |buffer overflow error RXOV (SCn_STATUS[0]), transmit buffer overflow error TXOV (SCn_STATUS[8]),
       * |        |          |receiver retry over limit error RXOVERR (SCn_STATUS[22]) and transmitter retry over limit error
       * |        |          |TXOVERR (SCn_STATUS[30]).
       * |        |          |0 = Transfer error interrupt Disabled.
       * |        |          |1 = Transfer error interrupt Enabled.
       * |[3]     |TMR0IEN   |Timer0 Interrupt Enable Bit
       * |        |          |This field is used to enable Timer0 interrupt function.
       * |        |          |0 = Timer0 interrupt Disabled.
       * |        |          |1 = Timer0 interrupt Enabled.
       * |[4]     |TMR1IEN   |Timer1 Interrupt Enable Bit
       * |        |          |This field is used to enable the Timer1 interrupt function.
       * |        |          |0 = Timer1 interrupt Disabled.
       * |        |          |1 = Timer1 interrupt Enabled.
       * |[5]     |TMR2IEN   |Timer2 Interrupt Enable Bit
       * |        |          |This field is used to enable Timer2 interrupt function.
       * |        |          |0 = Timer2 interrupt Disabled.
       * |        |          |1 = Timer2 interrupt Enabled.
       * |[6]     |BGTIEN    |Block Guard Time Interrupt Enable Bit
       * |        |          |This field is used to enable block guard time interrupt in receive direction.
